{
    "count": 3,
    "data": [{
        "id": 10,
        "primeOrganization": {
            "id": 2,
            "name": "General Electric (GE)"
        },
        "principalInvestigator": {
            "id": 14,
            "firstName": "Dean",
            "lastName": "Robinson",
            "email": "robinsondm@ge.com"
        },
        "projectStatus": {
            "id": 2,
            "name": "awarded"
        },
        "awardedDate": "2016-06-16",
        "endDate": "2017-12-16",
        "projectTitle": "Adaptive Machining Toolkit",
        "projectSummary": "Geometric-adaptive machining technology allows machine tools or robots to accommodate and adjust to variations in workpiece geometry and/or position. While it is possible to find commercially-available geometric-adaptive solutions today, existing solutions require highly expensive and time-consuming development of custom software and/or hardware. Further, implementation efforts require a means to ingest and align input data from metrology systems. These difficulties limit the ability of small and medium sized enterprises (SMEs) to adopt geometric-adaptive machining solutions in their operations, which could impact their global competitiveness. To overcome these challenges, a team led by GE Global Research (GE) proposes to develop a revolutionary new plug-and-play hardware and software toolkit that will enable legacy or modern CNC machines and robots to perform geometric-adaptive machining.  \n\n**If successful, what will the project provide or achieve?**  \n\n> The developed toolkit would enable existing CNC machine tools or robots to perform geometric adaptive machining with a relatively low investment. Geometric-adaptive machining reduces set-up time and improves quality in the machining of composites, castings, and additively-manufactured parts. It also minimizes the need for manual \"benching\" or finishing of machined components. The team foresees that deploying geometric adaptive machining across the U.S. would enable \"in-sourcing\" of machining or repair operations on complex components with a high degree of geometric variation.\n\n**What is the main deliverable of the project?**\n\n> 1) CAD platform independent software implementation of best fit & morphing algorithms, with associated documentation  \n> 2) Software implementation of probing localization, with associated documentation  \n> 3) Metrologic software updated with macros to run GE algorithms in the visual workflow  \n> 4) \"Virtual\" and \"live\" demonstrations of adaptive set up and machining of castings, plus one other demo  \n> 5) Document to train the workforce on the set up and deployment of adaptive machining",
        "principalPointOfContact": {
            "id": 1,
            "firstName": "Katie",
            "lastName": "Tillery-Merk",
            "email": "Katie.Tillery-Merk@uilabs.org"
        },
        "projectFocusArea": {
            "id": 3,
            "name": "Sensors & Metrology"
        },
        "projectThrust": {
            "id": 2,
            "name": "Intelligent Machining",
            "code": "IM"
        },
        "contributingCompanyIds": [144, 206, 245, 255],
        "rootNumber": 14,
        "callNumber": 7,
        "projectNumber": 1,
        "costShare": 1156586.00,
        "dmdiiFunding": 1156586.00,
        "projectIdentifier": "14-7-1"
    }, {
        "id": 4,
        "primeOrganization": {
            "id": 2,
            "name": "General Electric (GE)"
        },
        "principalInvestigator": {
            "id": 8,
            "firstName": "Benjamin",
            "lastName": "Beckmann",
            "email": "beckmann@ge.com"
        },
        "projectStatus": {
            "id": 2,
            "name": "awarded"
        },
        "awardedDate": "2015-12-22",
        "endDate": "2017-04-30",
        "projectTitle": "Elastic Cloud-Based Make",
        "projectSummary": "The proposed Elastic Cloud-Based Make (ECBM) project will transition multiple MS&A tools, developed under the AVM program, to the DMDII. Bringing together large industrial partners, former iFAB performers, and top-tier academic institutions, the proposed project will:\n\n1) transition iFab tools to the DMC, establishing a clear path to commercialization  \n2) demonstrate the iFAB tools via use cases of interest to DMDII members and the Department of Defense (DoD)   \n3) design and disseminate educational content to broaden the awareness and impact of the AVM tools\n\n**What is the industry problem this project addresses?**  \n\n> SME access to powerful MS&A tools\n\n**If successful, what will the project provide or achieve?**  \n\n> This project will establish a framework for companies, particularly SMEs, to gain access to the powerful MS&A tools developed under the previous DARPA AVM program.\n\n**What is the main deliverable of the project?**  \n\n> 1) transition iFab tools to the DMC, establishing a clear path to commercialization  \n> 2) demonstrate the iFAB tools via use cases of interest to DMDII members and the Department of Defense (DoD)  \n> 3) design and disseminate educational content to broaden the awareness and impact of the AVM tools",
        "principalPointOfContact": {
            "id": 3,
            "firstName": "Amanda",
            "lastName": "Needham",
            "email": "amanda.needham@uilabs.org"
        },
        "projectFocusArea": {
            "id": 1,
            "name": "Model-Based Design/Enterprise"
        },
        "projectThrust": {
            "id": 1,
            "name": "Advanced Manufacturing Enterprise",
            "code": "AME"
        },
        "contributingCompanyIds": [116, 161, 167, 182, 188, 191, 226],
        "rootNumber": 14,
        "callNumber": 1,
        "projectNumber": 10,
        "costShare": 1793018.00,
        "dmdiiFunding": 1793018.00,
        "projectIdentifier": "14-1-10"
    }, {
        "id": 28,
        "primeOrganization": {
            "id": 2,
            "name": "General Electric (GE)"
        },
        "principalInvestigator": {
            "id": 25,
            "firstName": "Lang",
            "lastName": "Yuan",
            "email": "l.yuan@ge.com"
        },
        "projectStatus": {
            "id": 2,
            "name": "awarded"
        },
        "awardedDate": "2016-09-12",
        "endDate": "2018-09-12",
        "projectTitle": "From Art-to-Part: Multidisciplinary Virtual Toolset for Laser Power-bed Fusion Additive Manufacturing and Multi-Step Post Processing Certification",
        "projectSummary": "GE Global Research will work with the University of Cincinnati, the University of Illinois at Urbana-Champaign, and TechSolve to develop an integrated framework and underlying toolsets to accelerate the process certification by shifting more than 60% of the process iterations to the virtual world, thus, reducing the certification time by a factor of three. While prior efforts have focused on optimizing the PBFAM process, this team will take a holistic look at optimizing a substantial subset of the manufacturing process chain. This includes the optimization of part geometry and material state through PBFAM, heat treatments and bulk machining. Analytical and process optimization tools will be developed including: \n\n1) model-based producibility tool for PBFAM and machining  \n2) PBFAM scan path optimization for high material integrity   \n3) prediction of thermal distortion  \n4) part compensation for distortion and machining   \n5) machining consideration and evaluation\n\nThe virtual tools will be integrated into the open-source platform, Digital Manufacturing Commons (DMC). This will allow the burgeoning AM industry to broadly adopt these modeling and simulation technologies, thus accelerating and standardizing their process certification methods. The project will also unlock tremendous value for small and medium size AM service providers and original equipment manufacturers to turn art-to-part in weeks instead of months with significant cost savings.\n\n**What is the industry problem this project addresses?**  \n\n> Structured methods to mature and certify PBFAM are in their infancy meaning that numerous process iterations are required to achieve the requisite form and fit tolerances, surface finish, and material integrity. Thermal distortion, feature dependent surface roughness, shrinkage, cracking, and porosity are known artifacts in the PBFAM process.\n\n**If successful, what will the project provide or achieve?**   \n\n> While prior efforts have solely focused on optimizing the PBFAM process, this team will take a holistic look at optimizing a substantial subset of the manufacturing process chain used to take a design from concept to the final part. It will be the first time to demonstrate an entire virtual workflow under an integrated system\n\n**What is the main deliverable of the project?**  \n\n> Four digital models from pre-processing to final machining evaluation that will be integrated into DMC Optimized workflow of digital manufacturing of PBFAM process",
        "principalPointOfContact": {
            "id": 3,
            "firstName": "Amanda",
            "lastName": "Needham",
            "email": "amanda.needham@uilabs.org"
        },
        "projectFocusArea": {
            "id": 2,
            "name": "Manufacturing Processes"
        },
        "projectThrust": {
            "id": 3,
            "name": "Advanced Analysis",
            "code": "AA"
        },
        "contributingCompanyIds": [219, 235, 237],
        "rootNumber": 15,
        "callNumber": 7,
        "projectNumber": 5,
        "costShare": 806232.00,
        "dmdiiFunding": 806232.00,
        "projectIdentifier": "15-7-5"
    }]
}
