[
  {"id":1,"q":"How do I get an account? Can you make an account for me?","a":"The DMC uses a federated single sign on system to make the login process as simple as possible for our users. This means that for most organizations, users will be able to use their organization login credentials to access the platform."},
  {"id":2,"q":"Can you make an account for me?","a":"The DMC can not create an account for you. Additionally, the DMC team does not have access to your account credentials as these are all handled by your identity provider. In the case of account created using the UI LABS Guest Account, we can work with you and Cirrus Identity to help recover your account."},
  {"id":3,"q":"How does the Digital Manufacturing Commons know my login information?","a":"The DMC does not store or have access to your account credentials. Instead we have you sign-in and authenticate directly with your identity provider."},
  {"id":4,"q":"My Organization does not appear on the list of approved federated single sign-on options. Why now? How do I get my organization on this list?","a":"Our list of single sign-on option comes from InCommon and a few social media identity providers. If you're organization is a part of InCommon but your Organization's name does not appear on the list of organizations for which you can sign in with, please get in contact with us and we will work with you to get your organization's name added to the list. If your organization is not part of InCommon but would still like to have the option to log in with your organization's credentials, please get in touch with us, but we would like to let you know ahead of time the process is not quick and is not a free service."},
  {"id":5,"q":"How do I Sign-in","a":"Instructions for signing into the DMC can be found on our platform's wiki page <u><a href=\"https://digitalmfgcommons.atlassian.net/wiki/pages/viewpage.action?pageId=83427338#GeneralFAQs(Beta)-LoggingIn\" target=\"_blank \"https://digitalmfgcommons.atlassian.net/wiki/pages/viewpage.action?pageId=83427338#GeneralFAQs(Beta)-LoggingIn style=\"color:green\">here</a></u>"}
]
