[
      {"id":1,"q":"What is the DMC Marketplace?","a":"The Marketplace in its current state is where DMC users can got to add free or demo applications to their workspaces to be run at their leisure. The intent of the Marketplace is to be a repository for applications that can be run on the DMC in the context of workspaces. These applications are usually built by our community as well as DMDII Project team members."},
      {"id":2,"q":"What are services/applications?","a":"Services and Application are actually one in the same. Our applications are code or tools that have been integrated with our DOME tool to allow for us to run these tools on our infrastructure, no longer requiring users to have any software installed on their own machines in order to allow for the applications to run. When the tools have completed running, your answer, analysis, file, or link will be available as an out put directly from the browser."},
      {"id":3,"q":"Where do the application in the Marketplace come from?","a":"The many of the applications you are able get from our Marketplace are simple calculator applications that we have used to start seeding our Marketplace. Many of the applications other applications you can or will be able to get from the marketplace are applications developed by our community users as well as by our DMDII members."},
      {"id":4,"q":"Can I create an application?","a":"Yes you can! We encourage as many of of users to create applications and content as possible. We believe that our success is dependent on our user base and we want our users to help drive the Marketplace as application creators. We have documentation to get everyone started with building DOME application available on platform's wiki which you can find <u><a href=\"https://digitalmfgcommons.atlassian.net/wiki/display/DMDIIDMC/Building+DOME+Models\" target=\"_blank \"https://digitalmfgcommons.atlassian.net/wiki/display/DMDIIDMC/Building+DOME+Models style=\"color:green\">here</a></u>."},
      {"id":5,"q":"Can I test my application on the live DMC platform?","a":"In the future individuals will have methods available to run applications they would like to test using our platform. While we are still the in the beta phase though we will not have this feature available to our users, but please be patient with us while we make sure our platform is safe, reliable and stable enough for individuals to use this feature."},
      {"id":6,"q":"How do I submit my application to have it available in the Marketplace?","a":"Our intent is to have a submission form on our website where you will submit your application to us along with the code to run it. We will take up to two weeks to review your form along with the application and we will let you know our decision. At the moment the form is not yet ready for users to submit their applications. We ask that until the form is ready, that you e-mail us as <u><a href=\"mailto:askdmc@uilabs.org\" style=\"color:green\">askdmc@uilabs.org</a></u> and let us know that you are interested in creating or submitting an DOME application to us to host."},
      {"id":7,"q":"I need assistance understanding how to build apps? Where can I get more information?","a":"To learn more about DOME please visit our platform's wiki page found on Confluence at the following link for <u><a href=\"https://digitalmfgcommons.atlassian.net/wiki/display/DMDIIDMC/Installing+and+Launching+DOME\" target=\"_blank \"https://digitalmfgcommons.atlassian.net/wiki/display/DMDIIDMC/Installing+and+Launching+DOME style=\"color:green\">DOME Start-up Guides</a></u> as well as our <u><a href=\"https://digitalmfgcommons.atlassian.net/wiki/display/DMDIIDMC/Building+DOME+Models\" target=\"_blank \"https://digitalmfgcommons.atlassian.net/wiki/display/DMDIIDMC/Building+DOME+Models style=\"color:green\">DOME application building tutorials</a></u>"},
      {"id":8,"q":"How do these application differ from those on different websites and platforms","a":"Our applications have the potential to be linked with other applications in interesting ways to create new application, which is a feature most platforms and websites do not support. Application Linking is estimated to be available in the early third quarter of 2017."}
]
