[
  {"id":1,"q":"What is the DMDII Member Portal?","a":"The DMDII Portal is a section of the Digital Manufacturing Commons where members of DMDII can visit to get more information about DMDII projects, project deliverables if appropriate, as well as get more information about DMDII members. The DMDII portal on the DMC allows members of DMDII to easily have access to digital resource directly from the website that are either available to all members or specific to your organization."},
  {"id":2,"q":"Is the DMDII Member Portal the entire purpose of the Digital Manufacturing Commons?","a":"This is a common question. The DMDII Portal is not the main website nor is it our main site functionality. The DMC is a an open source, web-based, manufacturing oriented platform. The DMDII Portal is simply hosted on the DMC and offers DMDII members somewhere to get all their DMDII resources in one place as well as give users the ability to access digital manufacturing solutions in one place."},
  {"id":3,"q":"Does my Organization have access to the DMDII Member portal?","a":"The DMC is a platform that actually allows everyone to have access. Though, during our closed beta, only DMDII members and special friends of the DMC will be granted access. If you are not a member of DMDII and would like to get access to the DMC's general features, go through the process of creating an account which you can learn to do <u><a href=\"\" target=\"_blank \" style=\"color:green\">here</a></u> and then please send us an e-mail at <u><a href=\"mailto:askdmc@uilabs.org\" style=\"color:green\">askdmc@uilabs.org</a></u> and we will help to get your account the proper access levels to use the platform."},
  {"id":4,"q":"I've created an account but I don't see any of the site's features. Is the site broken?","a":"Our platform is currently in a closed beta. What this means for your account is that until your organization administrator verifies that you a member of their organization, you will not be able to have access to the DMC. Currently the only organizations which have organization administrators to help you get through the verification process are DMDII member organization. We do offer an alternative method to get access to our platform during our closed beta, where you need to associate your account with the Digital Manufacturing Commons organization and then e-mail us at <u><a href=\"mailto:askdmc@uilabs.org\" style=\"color:green\">askdmc@uilabs.org</a></u> to recieve a verification token to give your account general site functionality."},
  {"id":5,"q":"Where can I find updates, documents, schedules, and funding for DMDII projects that my organization is a part of as well as other DMDII projects?","a":"To find information about DMDII Projects as a verified DMDII organization user, click on the DMDII Portal drop-down in the top menu and choose Projects Directory. From here find a project you may be interested in learning about by scrolling down or using the filters to the left of the project search bar. Once on a DMDII Project page you can find: <ul><li>Project updates under the updates tab</li><li>The award state of the project towards top right hand corner of the project's name</li><li>Information related to the project's financials can be found to the right of the award state of the project</li><li>The Awarded and Complete By dates of the project can be found in the top right hand corner of the page under the Key Dates section</li><li>A project schedule if available can be found under the Project Schedule Tab</li><li>The project summary can be found at the bottom of the page</li><li>Any documents that are available for your particular organization's access level related to the particular project are found under the Project Documents tab.<ul><li>By clicking on the document name on the left hand side then clicking on the here hyperlink or the download icon (both found on the right hand side) you will be able to view, read, watch or download different files from the browser.</li></ul></li><li>Finally, organizations participating in the project as well as the Principal Investigator and Project Manager can be found under the Project Contributers tab</li></ul>"},
  {"id":6,"q":"How do I download or view the documents that are available to me that are related to an awarded or closed DMDII Project?","a":"To access documents related to your project as well as view updates related to your project either:<ol><li>Click on DMDII Portal in the top menu</li><li>Choose Projects Directory</li><li>Find or search for your project name and click on the Project name when you find it</li></ol><ul>or:</ul><ol><li>Click on DMDII Portal in the top menu</li><li>Choose Member Directory</li><li>Find or search for your organization's name, then click on the organization's name</li><li>Scroll to the bottom of the page and click on the project name that you are interested in</li></ol><ul>or:</ul><ol><li>Click on My Organization in the top menu</li><li>Click on the Membership tab</li><li>Then click on the organization's name that appears as an underlined hyperlink</li><li>Scroll to the bottom of the page and click on the project name that you are interested in</li></ol>Once you've found the project you are interested in:<ol><li>Click on the Project Documents tab</li><li>Next, click on the name of the document you want to view, read, watch, or download</li><li>You will notice that the document information on the right hand side of the page will have updated, click on the \"here\" link or the download icon found under the Accessible By label to get access to the document in your browser.</li></ol>To find this for any DMDII Awarded or Completed Project:<ol><li>Click on DMDII Portal</li><li>Choose Project Directory from the drop-down that appears</li><li>Using the filters to the left of the search bar, click on Awarded or Completed, then scroll through the filtered results and click on the name of the project that interests you</li><il><li>Click on the Project Documents tab, click on the name of the document, then click on here to the right of download label, or click on the download icon which appears below the Accessible By label</li><li>To read project updates, click on the Project Updates tab</li><ul></ol>"},
  {"id":7,"q":"My Organization is part of a project at DMDII. Can I create and post project updates?","a":"It is the responsibility of the DMDII Project Manager to make the appropriate updates on the DMDII project page. If you feel something is missing or needs to be changed, please reach out to the project manager that is listed as responsible for your project."},
  {"id":8,"q":"How do I find which DMDII partners are located geographically closest to me?","a":"To get an idea of what DMDII member organization are found closest to your organization, visit the DMDII Member Directory by doing the following:<ol><li>Click on DMDI Portal in the top menu</li><li>Choose Member Directory from the drop-down</li></ol>Once on the Member Directory page, notice the map image. By hovering your mouse over the individual states you can find what other organization are found in your state. To further discover how close they are. Search for the organization location by doing the following:<ol><li>Click on Explore in the top menu</li><li>Choose Organizations from the drop-down</li><li>In the search bar at the top of the page, search for the organization you are interested in and click on their name on the card that appears below the search bar</li><li>Click on the Contact tab on the organization's profile page</li></ol>"},
  {"id":9,"q":"Where can I find information for past and upcoming DMDII Member and Project Events?","a":"Visit the DMDII Member Directory and Project Directory respectively to learn more about their past and upcoming events. Near the top of the page and you will find upcoming and archived events. You can visit these pages by clicking on DMDII Portal in the top menu and choosing the appropriate page to visit from the drop-down that appears."},
  {"id":10,"q":"My organization just did something really interesting and there is a great article that we would like DMDII partners to have the opportunity to read. What options do I have for sharing this on the DMDII Portal?","a":"If you would like this information to be shared on the DMDII portal, reach out to your membership contact person and send them the information you would like to be posted which includes a title, summary and a link if one exists.<br>You also have the option of posting this information to you organization's profiles page under Awards Section. To do so an organization administrator for your organization needs to do the following<ol><li>Click on My Organization in the top menu</li><li>Click on the Edit Company button at the top of the page</li><li>Under the Overview tab, Click on the green Add New Award button, provide a title, description, and link (if one exists) and then click on the green save button under the award</li><li>Click on the green Save button in the top right hand corner of the form</li></ol>"},
  {"id":11,"q":"I've heard that the Projects and Members Teams at DMDII tend to post articles, documents and other items on the portal. Where can I find these postings?","a":"You can find links, documents and messages that may be interesting for DMDII members in the Quicklinks section of the Portal. You can navigate to this page by:<ol><li>Clicking on DMDII Portal in the top menu</li><li>Choose Project Directory from the drop-down that appears</li><li>You will find quick links to the right of the Project Status and Project Overview images</li><li>Click on these to view the information the teams have posted</li></ol>"},
  {"id":12,"q":"I attended or missed a DMDII Project Showcase but I would like to be able to view, read, or download the documents that were going to be available after the event. Where do I go to get access to those documents on the DMC?","a":"To get access to the documents related to Showcase visit the DMDII Projects Directory by doing the following:<ul><li>Click on DMDII Portal in the top menu</li><li>Choose Projects Directory from the drop-down</li></ul>Once on Project Directory Page search for the showcase you missed. Showcases typically have a project number of 00-00-00 associated with them and are labeled with the data of the showcase. The document(s) can be found under the Project Documents tab or the Docs & Presentations tab."},
  {"id":13,"q":"I understand that as a DMDII member, my organization has two organization profiles. Other than the profile found by following the My Organization menu item link, where can I go to view my organization's DMDII Profile page and other DMDII Organization Profile pages?","a":"To access your DMDII Organization profile page in the DMDII Member Portal, which also lists what DMDII Projects your organization is a part of:<ol><li>Click on My Organization in the top menu</li><li>Click on the Membership tab</li><li>Then click on the organization's name that appears as an underlined hyperlink</li></ol><ul>or</ul><ol><li>Click on DMDII Portal in the top menu</li><li>Choose Member Directory from the drop-down that appears</li><li>Find or search for your organization using the list of members or the search bar respectively on the page</li><li>Click on the name of the organization</li></ol>"},
  {"id":14,"q":"As the organization administrator for my organization, I want to understand my responsibilities as well as what features I have available to me","a":"Please visit the following link to learn more: <u><a href=\"https://digitalmfgcommons.atlassian.net/wiki/pages/viewpage.action?pageId=83427340#MemberFAQs(Beta)-InstructionsforOrganizationAdmins\" target=\"_blank \"https://digitalmfgcommons.atlassian.net/wiki/pages/viewpage.action?pageId=83427340#MemberFAQs(Beta)-InstructionsforOrganizationAdmins style=\"color:green\">https://digitalmfgcommons.atlassian.net/wiki/pages/viewpage.action?pageId=83427340#MemberFAQs(Beta)-InstructionsforOrganizationAdmins</a></u>"},
  {"id":15,"q":"I've created an account but I still have not had my organization administrator send me a verification code to give me access to the DMDII portal. Can you help me get access?","a":"Once you r organization has a verified organization administrator we can not verify your account, but we can surely let you know who the organization administrator is so you can reach out to them. We will gladly e-mail them for you, cc-ing you, to let the organization admin know that you are interested in being verified and getting access to the DMDII Portal. Additionally you can visit your My Account page, by clicking on your display name in the right hand corner of any page and choosing My Account. From here you can click the green Re-send Notification button which will add a notification to your organization administrators' notifications list which they will see the next time they log in."},
  {"id":16,"q":"The Bell/Notifications Icon in the top menu of the website has a number in a green circle on my screen. What does this mean?","a":"<ul><li>If you see a number over the bell icon, this signifies that you have new notifications, usually for organization administrators. This means that there are new members waiting to get verified with your organization.</li><ul><li>The list can be cleared by clicking on Mark all as Read</li></ul><li>If you have a number over the envelope icon, this means you have been sent an invitation to join a workspace.<ul><li>By clicking on view all, you can choose to accept or decline any workspace invitations you receive.</li></ul></li></ul>"},
  {"id":17,"q":"How does my organization become a member of DMDII so we can have access to the DMDII Portal on the DMC?","a":"Information about DMDII Membership benefits and becoming a DMDII member can be found on the UI LABS website: <u><a href=\"http://www.uilabs.org/partners/become-a-partner/\" target=\"_blank \"http://www.uilabs.org/partners/become-a-partner/ style=\"color:green\">http://www.uilabs.org/partners/become-a-partner/</a></u>"}
]
