[
{
      "content": "Display-name Drop-down Menu",
      "notes":
      [
            {
                  "content": "My Account",
                  "notes":
                  [
                        {
                              "content": "Account Basics"
                        },
                        {
                              "content": "Privacy"
                        },
                        {
                              "content": "Notifications"
                        }
                  ]
            },
            {
                  "content": "My Profile",
                  "notes":
                  [
                    {
                      "content": "General File Upload Issue",
                      "notes":
                      [
                        {
                          "content": "Early users of our website would have noticed that at times when they would upload files to their workspaces' documents page, or pictures to their profile pages, those files at time would not pass our file scanning process and those files would not be retrievable. We found that the reason for this was due to special characters being contained in the file name that would not work well with our file storage solution. Characters such as: ? , | * & ^ etc, would during upload time cause the file to be considered malicious or unsafe. We've updated our upload process to now removed all special characters that could cause files to be tagged as unsafe by our platform before being scanned by our platform. False positives for dangerous files should no longer happen going forward.",
                          "class": "release-bug"
                        }
                      ]
                    }
                  ]
            },
            {
                  "content": "Create DMDII content"
            },
            {
                  "content": "Create DMDII Member"
            },
            {
                  "content": "Create DMDII Project"
            }
      ]
},
{
      "content": "Top Menu",
      "notes":
      [
            {
                  "content": "Invitations"
            },
            {
                  "content": "Notifications"
            }
      ]
},
{
      "content": "Footer",
      "notes":
      [
            {
                  "content": "FAQs"
            },
            {
                  "content": "Legal",
                  "notes":
                  [
                        {
                              "content": "General Terms of Service"
                        },
                        {
                              "content": "Member Terms of Service"
                        },
                        {
                              "content": "Privacy Policy"
                        },
                        {
                              "content": "App SLA"
                        },
                        {
                              "content": "DMCA"
                        }
                  ]
            },
            {
                  "content": "Contact Us"
            }
      ]
},
{
      "content":"Header",
      "notes":
      [
            {
                  "content": "Core",
                  "notes":
                  [
                        {
                              "content": "About the DMC"
                        },
                        {
                              "content": "DMC Security"
                        },
                        {
                              "content": "DMC Academia"
                        },
                        {
                              "content": "DMC Releases"
                        },
                        {
                              "content": "DMC Blog"
                        }
                  ]
            },
            {
                  "content": "Explore",
                  "notes":
                  [
                        {
                              "content": "Individuals",
                              "notes":
                              [
                                    {
                                          "content": "User Profile page"
                                    }
                              ]
                        },
                        {
                              "content": "Organizations",
                              "notes":
                              [
                                    {
                                          "content": "Organization Profile page",
                                          "notes":
                                          [
                                            {
                                              "content": "General File Upload Issue",
                                              "notes":
                                              [
                                                {
                                                  "content": "Early users of our website would have noticed that at times when they would upload files to their workspaces' documents page, or pictures to their profile pages, those files at time would not pass our file scanning process and those files would not be retrievable. We found that the reason for this was due to special characters being contained in the file name that would not work well with our file storage solution. Characters such as: ? , | * & ^ etc, would during upload time cause the file to be considered malicious or unsafe. We've updated our upload process to now removed all special characters that could cause files to be tagged as unsafe by our platform before being scanned by our platform. False positives for dangerous files should no longer happen going forward.",
                                                  "class": "release-bug"
                                                }
                                              ]
                                            },
                                            {
                                              "content": "Organization Tagging",
                                              "notes":
                                              [
                                                {
                                                  "content": "Organization Administrators can now tag other organizations with their relationship status, which are only viewable by members of your organization. The tags at this moment will allow administrators to tag organization with anything they wish, but in a future update the tag names will be predefined. Additionally these tags are not yet something that can be viewed after they are saved but will be in a future update. In the future, these tag will allow organizations to do things such as invite all of organizations with a particular tag to a workspace they wish for them to participate in.",
                                                  "class": "release-feature"
                                                }
                                              ]
                                            }
                                          ]
                                    }
                              ]
                        },
                        {
                              "content": "Activities"
                        },
                        {
                              "content": "Workspaces Directory",
                              "notes":
                              [
                                {
                                  "content": "Sorting in Workspace Directory",
                                  "notes":
                                  [
                                    {
                                      "content": "In a previous release, we updated the user interface for workspaces as well as provided the ability for users to sort workpspaces they are viewing in the directory list. After that release, when workspaces were being sorted by the date of workspace creation or by the name of the workspace, results at times would be repeated and each page visited would return only sorted information for what that page number would display before. Now when sorting results, what one wold expect to be returned is now being returned.",
                                      "class": "release-bug"
                                    }
                                  ]
                                },
                                {
                                  "content": "Filtering in Workspace Directory",
                                  "notes":
                                  [
                                    {
                                      "content": "In a previous release, we updated the user interface for workspaces as well as provided the ability for users to filter workspaces they are viewing in the directory. In that release, filtering would only filter workspaces found on that particular page list, so each next page a user would visit would have a different amount of results depending on the amount of matching results. Now each page a user visits has the same number of results and does not repeat information that has been shown to the user on previous pages.",
                                      "class": "release-bug"
                                    }
                                  ]
                                },
                                {
                                  "content": "Workspace Profile",
                                  "notes":
                                  [
                                        {
                                              "content": "Edit Workspace",
                                              "notes":
                                              [
                                                {
                                                  "content": "Workspace Delete Re-implemented",
                                                  "notes":
                                                  [
                                                    {
                                                      "content": "In a previous release, we implemented the ability for owners of workspaces to delete their workspaces. In a more recent update, that feature was lost in our deployment. Once we found this had happened, we reintroduced the code for this feature in this release.",
                                                      "class": "release-bug"
                                                    }
                                                  ]
                                                }
                                              ]
                                        },
                                        {
                                              "content": "Home"
                                        },
                                        {
                                              "content": "Discussions"
                                        },
                                        {
                                              "content": "Team"
                                        },
                                        {
                                              "content": "Documents",
                                              "notes":
                                              [
                                                {
                                                  "content": "General File Upload Issue",
                                                  "notes":
                                                  [
                                                    {
                                                      "content": "Early users of our website would have noticed that at times when they would upload files to their workspaces' documents page, or pictures to their profile pages, those files at time would not pass our file scanning process and those files would not be retrievable. We found that the reason for this was due to special characters being contained in the file name that would not work well with our file storage solution. Characters such as: ? , | * & ^ etc, would during upload time cause the file to be considered malicious or unsafe. We've updated our upload process to now removed all special characters that could cause files to be tagged as unsafe by our platform before being scanned by our platform. False positives for dangerous files should no longer happen going forward.",
                                                      "class": "release-bug"
                                                    }
                                                  ]
                                                },
                                                {
                                                  "content": "Last Scan Date for Uploaded Documents",
                                                  "notes":
                                                  [
                                                    {
                                                      "content": "Files that get uploaded to the website, be that on a workspace's document page or on a DMDII Project's Profile page, that file now include a property that shows when the file was scanned and passed our infrastructure's scans. Files that were uploaded previous to this will all be tagged as having been last scanned on the same day.",
                                                      "class": "release-feature"
                                                    }
                                                  ]
                                                },
                                                {
                                                  "content": "Encryption Type for Uploaded Files",
                                                  "notes":
                                                  [
                                                    {
                                                      "content": "Files that get uploaded to our website always get encrypted when stored. Going forward, each time a file is uploaded to our website, we will let you know when encryption method is being used to keep your files safe on our website. The encryption type will be listed in the file properties for workspace documents as well as DMDII Project documents.",
                                                      "class": "release-feature"
                                                    }
                                                  ]
                                                },
                                                {
                                                  "content": "Sharing Documents to Other Workspaces",
                                                  "notes":
                                                  [
                                                    {
                                                      "content": "Avid users of our website know that workspaces allow users to do team management, task management, application management, discussions and much more. Many users also use workspaces to store important documents for projects they are working on. With this release users now have the ability to share documents they've uploaded to their workspaces to other workspace (applicable to public and private workspaces). Workspace owners will be notified that someone is attempting to share a file with them and will need to decide whether to accept or decline whether the file should be accessible to members of the workspace.",
                                                      "class": "release-feature",
                                                      "notes":
                                                      [
                                                        {
                                                          "content": "Always make sure that after the file has been accepted, that the access leve for the file has been set, otherwise, team members may still not be able to access the files. The access level is changed by clicking the edit button for the particular file, click on the Access tab, choosing the access level from the drop-down menu, and finally saving your changes."
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                        },
                                        {
                                              "content": "Tasks"
                                        },
                                        {
                                              "content": "Workspace Services Directory",
                                              "notes":
                                              [
                                                {
                                                  "content": "Service Profile Page"
                                                },
                                                {
                                                  "content": "Application Run page",
                                                  "notes":
                                                  [
                                                    {
                                                      "content": "Application Inputs from Workspace Documents",
                                                      "notes":
                                                      [
                                                        {
                                                          "content": "Applications now can accept files as application inputs for files saved in workspace. Our marketplace is slowly growing, this being the case, to make user's experience a much less click intensive one as well as to make their experience a better one when running applications that require file input, we have introduced the ability to let users reference documents in their workspaces as the input. This has not yet been rolled out to all applications as we are not yet hosting many applications that require file inputs, but as more applications become available, we want to make sure that applications have this feature already built out and ready to be utilized. In this release we also have introduced two applications into the DMC Marketplace that utilize this very feature.",
                                                          "class": "release-feature",
                                                          "notes":
                                                          [
                                                            {
                                                              "content": "These new applications are the Technical Data Packaging Tool and the Manufacturing Should Cost Analysis"
                                                            },
                                                            {
                                                              "content": "To use a file as an input, simply upload it to a workspace document page. Once the file has been scanned and displays a SHA, the file is read to be used. Once the application has been added to a workspace, go to run the application. The interface will show a drop-down allowing the user to chose the workspace they wish to use the input from. Once the workspace has been chosen, a second drop-down menu will appear, this time to choose the file that will be used as an input."
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "content": "Saving Application Outputs",
                                                      "notes":
                                                      [
                                                        {
                                                          "content": "In a previous release, we introduced a feature to applications that allowed users to see outputs generated by successfully executed applications in their workspaces. In this release, we've expanded this functionality to allow users to save the output of those successful runs to thier workspace as long as the application generates a link to a file, which our two new marketplace applicartions actually do.",
                                                          "class": "release-feature",
                                                          "notes":
                                                          [
                                                            {
                                                              "content": "To save the run outputs to the application's respective workspace, a user will need to view the application's run history. Then click on the success status. This will bring up a modal showing the inputs and outputs of the application. Find the green Output to Workspace button, and click the ok button to save the output to the Workspace Documents page. The workspace creator, will need to accept the file in order for it to be viewable by other users."
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                        }
                                  ]
                                }
                              ]
                        }
                  ]
            },
            {
                  "content":"My Organization",
                  "notes":
                  [
                    {
                      "content": "General File Upload Issue",
                      "notes":
                      [
                        {
                          "content": "Early users of our website would have noticed that at times when they would upload files to their workspaces' documents page, or pictures to their profile pages, those files at time would not pass our file scanning process and those files would not be retrievable. We found that the reason for this was due to special characters being contained in the file name that would not work well with our file storage solution. Characters such as: ? , | * & ^ etc, would during upload time cause the file to be considered malicious or unsafe. We've updated our upload process to now removed all special characters that could cause files to be tagged as unsafe by our platform before being scanned by our platform. False positives for dangerous files should no longer happen going forward.",
                          "class": "release-bug"
                        }
                      ]
                    },
                    {
                      "content": "Virtual Production Capabilities (VPC) file for Organizations",
                      "notes":
                      [
                        {
                          "content": "Organization administrators can now generate what we call a VPC for their organizations. This VPC is summary of what the organization's Virtual Production Capabilities are, and once filled out, allows members of those organizations to use our new Manufacturing Should Cost Analysis application, which is now available in our marketplace. The VPC tab is only available for editing by verified organization administrators of their organizations",
                          "class": "release-feature",
                          "notes":
                          [
                            {
                              "content": "To generate the VPC, organizazation admninistrators can can vist their My Organization page and edit their organization's profile page. They will see a VPC tab in the body of the form where this can be done. Click into each category to see the questions. Any question left unanswered will not be saved to their VPC. When complete, click on the green save button at the bottom of the form to save the VPC inputs, and then click on the green save button at the top of the form to save the changes to the organization."
                            }
                          ]
                        }
                      ]
                    }
                  ]
            },
            {
                  "content": "Marketplace",
                  "notes":
                  [
                        {
                          "content": "Application Profile page"
                        }
                  ]
            },
            {
                  "content": "DMDII Portal",
                  "notes":
                  [
                        {
                              "content": "DMDII Member Directory",
                              "notes":
                              [
                                {
                                  "content": "DMDII Member Profile Page"
                                },
                                {
                                  "content": "General File Upload Issue",
                                  "notes":
                                  [
                                    {
                                      "content": "Early users of our website would have noticed that at times when they would upload files to their workspaces' documents page, or pictures to their profile pages, those files at time would not pass our file scanning process and those files would not be retrievable. We found that the reason for this was due to special characters being contained in the file name that would not work well with our file storage solution. Characters such as: ? , | * & ^ etc, would during upload time cause the file to be considered malicious or unsafe. We've updated our upload process to now removed all special characters that could cause files to be tagged as unsafe by our platform before being scanned by our platform. False positives for dangerous files should no longer happen going forward.",
                                      "class": "release-bug"
                                    }
                                  ]
                                }
                              ]
                        },
                        {
                              "content": "DMDII Projects Directory",
                              "notes":
                              [
                                {
                                  "content": "DMDII Project Profile",
                                  "notes":
                                  [
                                    {
                                      "content": "DMDII Project PoC Autocomplete Drop-down Menu",
                                      "notes":
                                      [
                                        {
                                          "content": "In the past DMDII Project teams members needed to add their contact information and names to their projects when adding a project or editing an existing project in the DMDII Projects Directory. Now DMDII Project team members can start typing their names into an autocomplete text field when creating or editing projects and choose the PoC from the drop-down to update project information.",
                                          "class": "release-feature"
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "content": "General File Upload Issue",
                                  "notes":
                                  [
                                    {
                                      "content": "Early users of our website would have noticed that at times when they would upload files to their workspaces' documents page, or pictures to their profile pages, those files at time would not pass our file scanning process and those files would not be retrievable. We found that the reason for this was due to special characters being contained in the file name that would not work well with our file storage solution. Characters such as: ? , | * & ^ etc, would during upload time cause the file to be considered malicious or unsafe. We've updated our upload process to now removed all special characters that could cause files to be tagged as unsafe by our platform before being scanned by our platform. False positives for dangerous files should no longer happen going forward.",
                                      "class": "release-bug"
                                    }
                                  ]
                                },
                                {
                                  "content": "Last Scan Date for Uploaded Documents",
                                  "notes":
                                  [
                                    {
                                      "content": "Files that get uploaded to the website, be that on a workspace's document page or on a DMDII Project's Profile page, that file now include a property that shows when the file was scanned and passed our infrastructure's scans. Files that were uploaded previous to this will all be tagged as having been last scanned on the same day.",
                                      "class": "release-feature"
                                    }
                                  ]
                                },
                                {
                                  "content": "Encryption Type for Uploaded Files",
                                  "notes":
                                  [
                                    {
                                      "content": "Files that get uploaded to our website always get encrypted when stored. Going forward, each time a file is uploaded to our website, we will let you know when encryption method is being used to keep your files safe on our website. The encryption type will be listed in the file properties for workspace documents as well as DMDII Project documents.",
                                      "class": "release-feature"
                                    }
                                  ]
                                }
                              ]
                        }
                  ]
            }
      ]
}
]
