[
      {"id":1,"q":"What is a Workspace?","a":"A Workspace is where you are able to manage a project on our platform. Workspaces are best used when working with a team and have many features that help to simplify team collaboration."},
      {"id":2,"q":"Where can I find Workspaces?","a":"Workspaces can be found in two place on our website. <ol><li>Click on your display name in the top right hand corner of the website and click on My Workspaces from the drop-down menu.</li><li>Click on Explore found in the site menu, then click on All Workspaces from the drop-down menu.</li></ol>"},
      {"id":3,"q":"What is the Difference between My Workspaces and All Workspaces?","a":"My Workspaces are workspaces that either you have created or you are a part of. All Workspaces are all Workspaces that are Public as well as the workspaces that appear in your My Workspaces Directory."},
      {"id":4,"q":"What kinds or workspaces are there?","a":"There are three kinds of Workspaces. <ol><li>Private - Only you and users you invite to join the Workspace have access to join and view the Workspace content.</li><li>Public (for all) - Anyone can see the workspace in the All Workspace directory and anyone can join the workspace by click on the Join button on the Workspace profile page.</li><li>Public (with admin approval) - Anyone can see the Workspace in the All Workspaces directory and the workspace can be joined if users click on the Request to Join button on the Workspace profile page and someone with access to the workspace must allow you access to view the Workspace's content.</li></ol>"},
      {"id":5,"q":"How do I get access to a private workspace?","a":"You must either be invited by the workspaces creator at the time the workspace was created, or you must be granted access to the workspace by someone with access to the private Workspace. This is done by one of two methods:<ul><li>In the Workspace, someone with access must click on the Menu button, then the team icon, then the invite icon in the top right hand corner of the page, add the user's or users' name(s) the click on the green save button.</li></ul><ul>Or</ul><ul><li>Someone with access to the Workspace, when on the Workspace page, click on edit, skip to the next page, add the user's or users' name(s) and click on the green save button at the bottom of the page.</li></<ol>"},
      {"id":6,"q":"How do I get access to public workspaces?","a":"To get access to a public (for all) Workspace, visit the Workspace profile page and click on the green Join button in the top right hand corner of the page. Leave the page and come back and you will have access to the workspace. To get access to a public (with admin approval) Workspace, visit the Workspace profile page and click on the green Request button in the top right hand corner of the page. A user that already has access will need to accept your request for you to gain access."},
      {"id":7,"q":"How do I make a workspace?","a":"Visit either the All or My Workspace directory page, then click on the Add Workspace button at the top center of the page. Fill in at minimum the following fields: Title, Overview, Type, and Approval Option is appropriate. Click on the green Next button. Search for or locate the users you want to have access to your workspace. Then click on the green Create button in the bottom right hand corner of the page."},
      {"id":8,"q":"What features exist in Workspaces?","a":"Workspaces have all the following features:<ul><li>Overview</li><li>Discussions</li><li>Tagging</li><li>Task System</li><li>Services/Applications</li><li>Team Management</li><li>Advanced Document Management</li></ul>"}
]
